[
  {
    "sectionId": 1,
    "tarkasangraha_sectionId": 1,
    "title": "Maṅgalācaraṇam",
    "content": "Having placed Viśveśa in the heart and performed vandanam to the Guru, this Tarka-saṃgraha is composed for the sukha-bodha (easy understanding) of bālas (beginners)."
  },
  {
    "sectionId": 2,
    "tarkasangraha_sectionId": 2,
    "title": "Sapta-padārthāḥ",
    "content": "Dravya (substance), Guṇa (quality), Karma (action), Sāmānya (generality), Viśeṣa (particularity), Samavāya (inherence), and Abhāva (non-existence) are the seven Padārthas."
  },
  {
    "sectionId": 3,
    "tarkasangraha_sectionId": 3,
    "title": "Dravyāṇi",
    "content": "Among those, the Dravyas are only nine: Pṛthivī (earth), Ap (water), Tejas (light/fire), Vāyu (air), Ākāśa (ether), Kāla (time), Dik (space/direction), Ātman (self/soul), and Manas (mind)."
  },
  {
    "sectionId": 4,
    "tarkasangraha_sectionId": 4,
    "title": "Guṇāḥ",
    "content": "Rūpa (color), Rasa (taste), Gandha (smell), Sparśa (touch), Saṃkhyā (number), Parimāṇa (magnitude), Pṛthaktva (distinctness), Saṃyoga (conjunction), Vibhāga (disjunction), Paratva (priority), Aparatva (posteriority), Gurutva (weight), Dravatva (fluidity), Sneha (viscidity), Śabda (sound), Buddhi (cognition), Sukha (pleasure), Duḥkha (pain), Icchā (desire), Dveṣa (aversion), Prayatna (effort), Dharma (merit), Adharma (demerit), and Saṃskāra (faculty/impression) are the twenty-four Guṇas."
  },
  {
    "sectionId": 5,
    "tarkasangraha_sectionId": 5,
    "title": "Karmāṇi",
    "content": "Utkṣepaṇa (upward motion), Apakṣepaṇa (downward motion), Ākuñcana (contraction), Prasāraṇa (expansion), and Gamana (locomotion) are the five Karmas."
  },
  {
    "sectionId": 6,
    "tarkasangraha_sectionId": 6,
    "title": "Sāmānyam",
    "content": "Sāmānya is of two kinds: Para (higher) and Apara (lower)."
  },
  {
    "sectionId": 7,
    "tarkasangraha_sectionId": 7,
    "title": "Viśeṣaḥ",
    "content": "Viśeṣas, which reside in nitya-dravyas (eternal substances), are indeed ananta (infinite)."
  },
  {
    "sectionId": 8,
    "tarkasangraha_sectionId": 8,
    "title": "Samavāyaḥ",
    "content": "Samavāya, however, is only eka (one)."
  },
  {
    "sectionId": 9,
    "tarkasangraha_sectionId": 9,
    "title": "Abhāvāḥ",
    "content": "Abhāva is of four kinds: Prāgabhāva (antecedent), Pradhvaṃsābhāva (after destruction), Atyantābhāva (absolute), and Anyonyābhāva (mutual)."
  },
  {
    "sectionId": 10,
    "tarkasangraha_sectionId": 10,
    "title": "Pṛthivī (Earth)",
    "content": "Among those, Pṛthivī is that which possesses Gandha (smell). It is of two types: Nitya (eternal) and Anitya (perishable). The Nitya form is Paramāṇu-rūpa (atomic). The Anitya form is Kārya-rūpa (as an effect/product). It is further of three kinds: Śarīra (body), Indriya (organ), and Viṣaya (object). The Śarīra is that of us humans and others. The Indriya is the Ghrāṇa (olfactory organ) which perceives Gandha and resides at the tip of the nose (Nāsāgra). The Viṣaya consists of clay, stones, and so on."
  },
  {
    "sectionId": 11,
    "tarkasangraha_sectionId": 11,
    "title": "Āpaḥ (Water)",
    "content": "Āpaḥ is that which possesses Śīta-sparśa (cold touch). It is of two types: Nitya and Anitya. The Nitya form is Paramāṇu-rūpa. The Anitya form is Kārya-rūpa. It is further of three kinds: Śarīra, Indriya, and Viṣaya. The Śarīra is in Varuṇa-loka. The Indriya is Rasana (the organ of taste) which perceives Rasa (taste) and resides at the tip of the tongue (Jihvāgra). The Viṣaya consists of rivers, oceans, and so on."
  },
  {
    "sectionId": 12,
    "tarkasangraha_sectionId": 12,
    "title": "Tejas (Light/Fire)",
    "content": "Tejas is that which possesses Uṣṇa-sparśa (hot touch). It is of two types: Nitya and Anitya. The Nitya form is Paramāṇu-rūpa. The Anitya form is Kārya-rūpa. It is further of three kinds: Śarīra, Indriya, and Viṣaya. The Śarīra is in Āditya-loka (the sun). The Indriya is Cakṣus (the organ of sight) which perceives Rūpa (color/form) and resides at the front of the black pupil of the eye (Kṛṣṇatārāgra). The Viṣaya is of four kinds: Bhauma (terrestrial), Divya (celestial), Udarya (abdominal), and Ākaraja (mining-born). Bhauma is fire and such. Divya is that which has water as fuel, like lightning. Udarya is the cause of digestion of eaten food. Ākaraja consists of gold and such."
  },
  {
    "sectionId": 13,
    "tarkasangraha_sectionId": 13,
    "title": "Vāyu (Air)",
    "content": "Vāyu is that which is devoid of Rūpa (color) but possesses Sparśa (touch). It is of two types: Nitya and Anitya. The Nitya form is Paramāṇu-rūpa. The Anitya form is Kārya-rūpa. It is further of three kinds: Śarīra, Indriya, and Viṣaya. The Śarīra is in Vāyu-loka. The Indriya is Tvaka (the organ of touch) which perceives Sparśa and resides throughout the whole body. The Viṣaya is the cause of the shaking of trees and such."
  },
  {
    "sectionId": 14,
    "tarkasangraha_sectionId": 14,
    "title": "Prāṇa-vāyu (Vital Air)",
    "content": "Vāyu circulating inside the body is called Prāṇa. Although it is one, it receives names such as Prāṇa, Apāna, etc., due to its different functions/limiting adjuncts (Upādhi-bheda)."
  },
  {
    "sectionId": 15,
    "tarkasangraha_sectionId": 15,
    "title": "Ākāśa (Ether)",
    "content": "Ākāśa is that which has Śabda (sound) as its Guṇa (quality). It is one (Eka), all-pervading (Vibhu), and eternal (Nitya)."
  },
  {
    "sectionId": 16,
    "tarkasangraha_sectionId": 16,
    "title": "Kāla (Time)",
    "content": "Kāla is the cause of the usage of terms like \"past\" (Atīta) and so on. It is one, all-pervading, and eternal."
  },
  {
    "sectionId": 17,
    "tarkasangraha_sectionId": 17,
    "title": "Dik (Space/Direction)",
    "content": "Dik is the cause of the usage of terms like \"east\" (Prācī) and so on. It is one, all-pervading, and eternal."
  },
  {
    "sectionId": 18,
    "tarkasangraha_sectionId": 18,
    "title": "Ātman (Self/Soul)",
    "content": "Ātman is the substratum (Adhikaraṇa) of Jñāna (knowledge). It is of two kinds: Paramātman (Supreme Soul) and Jīvātman (Individual Soul). Among these, Īśvara is the omniscient (Sarvajña) Paramātman, who is only one. The Jīvātman is different in each body, all-pervading, and eternal."
  },
  {
    "sectionId": 19,
    "tarkasangraha_sectionId": 19,
    "title": "Manas (Mind)",
    "content": "Manas is the Indriya (internal organ) which is the instrument for the perception of pleasure (Sukha) and so on. Because it is limited to each Ātman, it is infinite in number (Ananta), atomic in form (Paramāṇu-rūpa), and eternal."
  },
  {
    "sectionId": 20,
    "tarkasangraha_sectionId": 20,
    "title": "Rūpa (Color)",
    "content": "Rūpa is the Guṇa (quality) perceived only by the Cakṣus (organ of sight). It is of seven kinds: Śukla (white), Nīla (blue), Pīta (yellow), Rakta (red), Harita (green), Kapiśa (brown), and Citra (variegated). It resides in Pṛthivī (earth), Jala (water), and Tejas (fire). In Pṛthivī, all seven kinds are present. In Jala, it is Abhāsvara-śukla (non-lustrous white). In Tejas, it is Bhāsvara-śukla (lustrous white)."
  },
  {
    "sectionId": 21,
    "tarkasangraha_sectionId": 21,
    "title": "Rasa (Taste)",
    "content": "Rasa is the Guṇa perceived by the Rasana (organ of taste). It is of six kinds: Madhura (sweet), Amla (sour), Lavaṇa (salty), Kaṭu (pungent), Kaṣāya (astringent), and Tikta (bitter). It resides in Pṛthivī and Jala. In Pṛthivī, all six kinds are present. In Jala, it is only Madhura."
  },
  {
    "sectionId": 22,
    "tarkasangraha_sectionId": 22,
    "title": "Gandha (Smell)",
    "content": "Gandha is the Guṇa perceived by the Ghrāṇa (organ of smell). It is of two kinds: Surabhi (fragrant) and Asurabhi (foul-smelling). It resides only in Pṛthivī (Pṛthivī-mātra-vṛtti)."
  },
  {
    "sectionId": 23,
    "tarkasangraha_sectionId": 23,
    "title": "Sparśa (Touch)",
    "content": "Sparśa is the Guṇa perceived only by the Tvaka (organ of touch). It is of three kinds: Śīta (cold), Uṣṇa (hot), and Anuṣṇāśīta (neither hot nor cold). It resides in Pṛthivī, Jala, Tejas, and Vāyu. Śīta is in Jala; Uṣṇa is in Tejas; Anuṣṇāśīta is in Pṛthivī and Vāyu."
  },
  {
    "sectionId": 24,
    "tarkasangraha_sectionId": 24,
    "title": "Rūpādi-catuṣṭaya (The Four Qualities)",
    "content": "The group of four beginning with Rūpa (Rūpa, Rasa, Gandha, Sparśa) in Pṛthivī are Pākaja (produced by heat/cooking) and Anitya (impermanent). In other substances, they are Apākaja (not produced by heat) and are either Nitya (eternal) or Anitya. They are Nitya when residing in eternal substances (Nitya-gata) and Anitya when residing in impermanent substances (Anitya-gata)."
  },
  {
    "sectionId": 25,
    "tarkasangraha_sectionId": 25,
    "title": "Saṃkhyā (Number)",
    "content": "Saṃkhyā is the cause of the usage of terms like \"one\" (Ekatva) and so on. It resides in all nine substances (Nava-dravya-vṛtti). It ranges from one (Ekatva) to the highest number (Parārdha). Ekatva is both Nitya and Anitya (eternal in eternal substances, impermanent in others). However, duality (Dvitva) and further numbers are always Anitya everywhere."
  },
  {
    "sectionId": 26,
    "tarkasangraha_sectionId": 26,
    "title": "Parimāṇa (Magnitude)",
    "content": "Parimāṇa is the extraordinary cause of the usage of measurements (Māna). It resides in all nine substances (Nava-dravya-vṛtti). It is of four kinds: Aṇu (atomic/small), Mahat (large/massive), Dīrgha (long), and Hrasva (short)."
  },
  {
    "sectionId": 27,
    "tarkasangraha_sectionId": 27,
    "title": "Pṛthaktva (Distinctness)",
    "content": "Pṛthaktva is the extraordinary cause of the usage of the term \"distinct\" or \"separate\" (Pṛthag). It resides in all substances (Sarva-dravya-vṛtti)."
  },
  {
    "sectionId": 28,
    "tarkasangraha_sectionId": 28,
    "title": "Saṃyoga (Conjunction)",
    "content": "Saṃyoga is the cause of the usage of the term \"joined\" or \"connected\" (Saṃyukta). It resides in all substances."
  },
  {
    "sectionId": 29,
    "tarkasangraha_sectionId": 29,
    "title": "Vibhāga (Disjunction)",
    "content": "Vibhāga is the Guṇa that destroys Saṃyoga (conjunction). It resides in all substances."
  },
  {
    "sectionId": 30,
    "tarkasangraha_sectionId": 30,
    "title": "Paratva and Aparatva (Priority and Posteriority)",
    "content": "Paratva (remoteness/seniority) and Aparatva (proximity/juniority) are the extraordinary causes of the usage of the terms \"further/older\" (Para) and \"nearer/younger\" (Apara). They reside in the first four substances (Pṛthivī, Jala, Tejas, Vāyu) and in Manas. They are of two types: Dik-kṛta (spatial) and Kāla-kṛta (temporal). Spatial Paratva belongs to that which is far away, while spatial Aparatva belongs to that which is nearby. Temporal Paratva belongs to the elder (Jyeṣṭha), and temporal Aparatva belongs to the younger (Kaniṣṭha)."
  },
  {
    "sectionId": 31,
    "tarkasangraha_sectionId": 31,
    "title": "Gurutva (Weight/Gravity)",
    "content": "Gurutva is the non-inherent cause (Asamavāyi-kāraṇa) of the first act of falling (Ādya-patana). It resides in Pṛthivī and Jala."
  },
  {
    "sectionId": 32,
    "tarkasangraha_sectionId": 32,
    "title": "Dravatva (Fluidity)",
    "content": "Dravatva is the non-inherent cause (Asamavāyi-kāraṇa) of the first act of flowing (Ādya-syandana). It resides in Pṛthivī, Ap, and Tejas. It is of two types: Sāṃsiddhika (natural/intrinsic) and Naimittika (instrumental/produced). Sāṃsiddhika-dravatva is in Jala (water). Naimittika-dravatva is in Pṛthivī and Tejas. In Pṛthivī, it is produced by the contact of fire (Agni-saṃyoga) as seen in ghee (Ghṛta) and similar substances. In Tejas, it is found in gold (Suvarṇa) and so on."
  },
  {
    "sectionId": 33,
    "tarkasangraha_sectionId": 33,
    "title": "Sneha (Viscidity/Oiliness)",
    "content": "Sneha is the Guṇa which is the cause of the clumping together of powders and such (Cūrṇādi-piṇḍībhāva-hetu). It resides only in Jala (Jala-mātra-vṛtti)."
  },
  {
    "sectionId": 34,
    "tarkasangraha_sectionId": 34,
    "title": "Śabda (Sound)",
    "content": "Śabda is the Guṇa perceived by the Śrotra (organ of hearing). It resides only in Ākāśa. It is of two types: Dhvanyātmaka (inarticulate sound) and Varṇātmaka (articulate/lettered sound). Dhvanyātmaka is sound produced by drums (Bherī) and such. Varṇātmaka consists of the sounds of the Sanskrit language and so on."
  },
  {
    "sectionId": 35,
    "tarkasangraha_sectionId": 35,
    "title": "Buddhi (Intellect/Cognition)",
    "content": "Buddhi, also called Jñāna (knowledge), is the Guṇa that is the cause of all communication/dealings (Sarva-vyavahāra). It is of two types: Smṛti (memory) and Anubhava (apprehension). Knowledge produced only by impressions (Saṃskāra-mātra-janya) is Smṛti. Knowledge different from that is Anubhava. It is of two types: Yathārtha (valid/true) and Ayathārtha (invalid/false). Yathārtha-anubhava is the experience of an object as it truly is—predicating a property of a thing that actually possesses it; for example, the knowledge \"This is a pot.\" This is also called Pramā. Ayathārtha-anubhava is the experience of an object as it is not—predicating a property of a thing that does not possess it; for example, the knowledge of silver in a mother-of-pearl shell (Śukti). This is also called Apramā."
  },
  {
    "sectionId": 36,
    "tarkasangraha_sectionId": 36,
    "title": "Pramāṇāni (Means of Knowledge)",
    "content": "Yathārtha-anubhava is of four kinds: Pratyakṣa (perception), Anumiti (inference), Upamiti (comparison), and Śābda (verbal testimony). Its instruments (Karaṇa) are also of four kinds: Pratyakṣa (the faculty of perception), Anumāna (the process of inference), Upamāna (the process of comparison), and Śabda (the word)."
  },
  {
    "sectionId": 37,
    "tarkasangraha_sectionId": 37,
    "title": "Kārya-kāraṇa-bhāva (Causality)",
    "content": "The extraordinary cause (Asādhāraṇa-kāraṇa) is the Karaṇa (instrument). A Kāraṇa (cause) is that which invariably precedes the effect (Kārya-niyata-pūrva-vṛtti). An effect (Kārya) is the counter-correlative of its own antecedent non-existence (Prāgabhāva-pratiyogi)."
  },
  {
    "sectionId": 38,
    "tarkasangraha_sectionId": 38,
    "title": "Kāraṇa-traividhyam (Three Types of Causes)",
    "content": "Cause is of three kinds: Samavāyi (inherent), Asamavāyi (non-inherent), and Nimitta (instrumental). \n1. Samavāyi-kāraṇa: That in which the effect arises as intimately related/inherent. For example, threads are the Samavāyi-kāraṇa of a cloth, and the cloth is the Samavāyi-kāraṇa of its own color and qualities. \n2. Asamavāyi-kāraṇa: A cause that is inherent in the same object along with the effect or along with the inherent cause. For example, the conjunction of threads (Tantu-saṃyoga) is the Asamavāyi-kāraṇa of the cloth; the color of the threads is the Asamavāyi-kāraṇa of the color of the cloth. \n3. Nimitta-kāraṇa: A cause different from both of these. For example, the shuttle, loom, and weaver are the Nimitta-kāraṇa of the cloth. Among these three types, the extraordinary cause is the Karaṇa (instrument)."
  },
  {
    "sectionId": 39,
    "tarkasangraha_sectionId": 39,
    "title": "Pratyakṣam (Perception)",
    "content": "Pratyakṣa is the instrument of perceptual knowledge. Knowledge produced by the contact of a sense-organ with its object (Indriyārtha-sannikarṣa) is Pratyakṣa. It is of two types: Nirvikalpaka (indeterminate) and Savikalpaka (determinate). Nirvikalpaka is knowledge without a predicate (e.g., \"This is something\"). Savikalpaka is knowledge with a predicate, such as \"This is Dittha,\" \"This is a Brahmin,\" or \"This is black.\""
  },
  {
    "sectionId": 40,
    "tarkasangraha_sectionId": 40,
    "title": "Sannikarṣa (Sense-Object Contact)",
    "content": "The contact between sense and object, which is the cause of perceptual knowledge, is of six kinds: \n1. Saṃyoga (Conjunction): For perceiving a pot with the eye. \n2. Saṃyukta-samavāya (Inherent relatedness to the conjoined): For perceiving the color of the pot (color is inherent in the pot which is conjoined with the eye). \n3. Saṃyukta-samaveta-samavāya (Inherence in the inherent related to the conjoined): For perceiving the \"color-ness\" (Rūpatva) generality. \n4. Samavāya (Inherence): For perceiving sound by the ear (the ear is Ākāśa, and sound is a quality of Ākāśa). \n5. Samaveta-samavāya (Inherence in the inherent): For perceiving \"sound-ness\" (Śabdatva). \n6. Viśeṣaṇa-viśeṣya-bhāva (Qualifier-qualified relation): For perceiving Abhāva (non-existence), such as \"The ground is characterized by the absence of a pot.\" Thus, knowledge produced by these six contacts is Pratyakṣa, and the sense-organ is the Pramāṇa."
  },
  {
    "sectionId": 41,
    "tarkasangraha_sectionId": 41,
    "title": "Anumānam (Inference)",
    "content": "Anumāna is the instrument of Anumiti (inferential knowledge). Anumiti is knowledge produced by Parāmarśa. Parāmarśa is the knowledge that the subject (Pakṣa) possesses a characteristic which is invariably concomitant with the thing to be inferred (Vyāpti-viśiṣṭa-pakṣadharma-tā-jñāna). For example, the knowledge \"This mountain has smoke, which is pervaded by fire\" is Parāmarśa. The resulting knowledge \"The mountain has fire\" is Anumiti. Vyāpti (pervasion) is the rule of invariable concomitance: \"Wherever there is smoke, there is fire.\" The presence of the pervaded (smoke) in the subject (mountain) is Pakṣadharma-tā."
  },
  {
    "sectionId": 42,
    "tarkasangraha_sectionId": 42,
    "title": "Svārtha-Parārtha-Anumāne (Inference for Oneself and Others)",
    "content": "Inference is of two types: Svārtha (for oneself) and Parārtha (for others). Svārtha is for one's own inferential knowledge: a person observes in a kitchen that \"wherever there is smoke, there is fire,\" goes to a mountain, sees smoke, remembers the Vyāpti, and concludes \"The mountain has fire.\" Parārtha is when one, after inferring fire for oneself, uses the five-membered syllogism (Pañcāvayava-vākya) to demonstrate it to another. \n1. Pratijñā: The mountain has fire.\n2. Hetu: Because it has smoke.\n3. Udāharaṇa: Whosoever has smoke has fire, like a kitchen.\n4. Upanaya: And this mountain is so.\n5. Nigamana: Therefore, it is so."
  },
  {
    "sectionId": 43,
    "tarkasangraha_sectionId": 43,
    "title": "Pañcāvayava (The Five Members)",
    "content": "The five members are:\n1. Pratijñā (Proposition): The mountain has fire.\n2. Hetu (Reason): Because of smoke.\n3. Udāharaṇa (Example): Whatever has smoke has fire, as in a kitchen.\n4. Upanaya (Application): This mountain is similarly smoky.\n5. Nigamana (Conclusion): Therefore, it has fire."
  },
  {
    "sectionId": 44,
    "tarkasangraha_sectionId": 44,
    "title": "Liṅga-parāmarśa (Consideration of the Sign)",
    "content": "In both Svārtha and Parārtha inferences, the instrument is the Liṅga-parāmarśa (the consideration of the sign). Therefore, Liṅga-parāmarśa is the Anumāna."
  },
  {
    "sectionId": 45,
    "tarkasangraha_sectionId": 45,
    "title": "Liṅga-traividhyam (Three Types of Signs)",
    "content": "The sign (Liṅga) is of three kinds: \n1. Anvaya-vyatireki: Having pervasion through both presence and absence. (e.g., Smoke: Where there is smoke, there is fire; where there is no fire, there is no smoke).\n2. Kevalānvayi: Having pervasion only through presence. (e.g., \"A pot is nameable because it is knowable.\" Everything is knowable and nameable, so there is no instance where both are absent).\n3. Kevala-vyatireki: Having pervasion only through absence. (e.g., \"Earth is different from others because it has smell.\" Since only Earth has smell, you can only prove it by saying \"That which is not different from others (like water) does not have smell\")."
  },
  {
    "sectionId": 46,
    "tarkasangraha_sectionId": 46,
    "title": "Pakṣa, Sapakṣa, and Vipakṣa (Terms of Inference)",
    "content": "1. Pakṣa: The subject in which the presence of the thing to be inferred (Sādhya) is doubtful. For example, the mountain, when smoke is the reason (Hetu).\n2. Sapakṣa: An instance where the Sādhya is known to exist for certain. For example, the kitchen in the same inference.\n3. Vipakṣa: An instance where the absence of the Sādhya is known for certain. For example, a deep lake in the same inference."
  },
  {
    "sectionId": 47,
    "tarkasangraha_sectionId": 47,
    "title": "Hetvābhāsas (Logical Fallacies)",
    "content": "There are five types of fallacious reasons: \n1. Savyabhicāra (Inconclusive): Also called Anaikāntika. It is of three types:\n  * Sādhāraṇa: The reason exists where the Sādhya is absent (e.g., \"The mountain has fire because it is knowable/measurable\"—knowability exists in a lake where fire is absent).\n  * Asādhāraṇa: The reason exists only in the Pakṣa and nowhere else (e.g., \"Sound is eternal because it has sound-ness\").\n  * Anupasaṃhārī: When everything is the subject, leaving no example for comparison (e.g., \"Everything is non-eternal because it is knowable\").\n2. Viruddha (Contradictory): A reason pervaded by the absence of the Sādhya (e.g., \"Sound is eternal because it is produced\"). Being \"produced\" actually proves non-eternality.\n3. Satpratipakṣa (Counter-balanced): When there is another reason proving the opposite of the Sādhya (e.g., Argument A: \"Sound is eternal because it is audible\"; Argument B: \"Sound is non-eternal because it is an effect\").\n4. Asiddha (Unproved): Of three types: \n  * Āśrayāsiddha: The subject itself doesn't exist (e.g., \"The sky-lotus is fragrant\").\n  * Svarūpāsiddha: The reason doesn't exist in the subject (e.g., \"Sound is a quality because it is visible\"—sound is not visible).\n  * Vyāpyatvāsiddha: A reason that is \"conditioned\" (Sopādhika). An Upādhi (condition) is that which pervades the Sādhya but does not pervade the Hetu. (e.g., \"Where there is fire, there is smoke\"—the condition is \"wet fuel,\" which is not present in a red-hot iron ball).\n5. Bādhita (Contradicted): When the absence of the Sādhya is already proved by another stronger means of knowledge like perception (e.g., \"Fire is cold because it is a substance\"—perception already proves fire is hot)."
  },
  {
    "sectionId": 48,
    "tarkasangraha_sectionId": 48,
    "title": "Upamānam (Comparison)",
    "content": "Upamāna is the instrument of Upamiti (knowledge by comparison). Upamiti is the knowledge of the relation between a name and the object it denotes (Saṃjñā-saṃjñī-sambandha). Its instrument is the knowledge of similarity (Sādṛśya). For example: A man who doesn't know what a Gavaya (wild ox) is hears from a forest-dweller that \"a Gavaya is like a cow.\" He goes to the forest, sees an animal similar to a cow, remembers the instruction, and concludes: \"This object is what is denoted by the word 'Gavaya'.\""
  },
  {
    "sectionId": 49,
    "tarkasangraha_sectionId": 49,
    "title": "Śabda-pramāṇam (Verbal Testimony)",
    "content": "Śabda (as a means of knowledge) is the word of an Āpta (a reliable person). An Āpta is one who speaks the truth as it is. A Vākya (sentence) is a collection of Pada (words), such as \"Bring the white cow with a stick.\" A Pada is that which has Śakti (potency/significative force). Śakti is the conventional relation established (by Divine Will) that \"such and such a meaning should be understood from such and such a word.\""
  },
  {
    "sectionId": 50,
    "tarkasangraha_sectionId": 50,
    "title": "Vākyārtha-jñāna-hetavaḥ (Causes of Sentential Meaning)",
    "content": "There are three causes for understanding the meaning of a sentence: \n1. Ākāṅkṣā (Expectancy): The inability of a word to convey a complete sense without another word (e.g., \"Bring...\" expects an object).\n2. Yogyatā (Compatibility): The lack of contradiction in the sense (e.g., \"Watering\" is compatible with water, not fire).\n3. Sannidhi (Proximity): The utterance of words without a long time-gap."
  },
  {
    "sectionId": 51,
    "tarkasangraha_sectionId": 51,
    "title": "Apramāṇa-vākya (Invalid Sentences)",
    "content": "A sentence lacking these three is invalid:\n1. \"Cow, horse, man, elephant\" fails due to lack of Ākāṅkṣā.\n2. \"He sprinkles with fire\" fails due to lack of Yogyatā.\n3. \"Bring... [1 hour gap] ...the cow\" fails due to lack of Sannidhi."
  },
  {
    "sectionId": 52,
    "tarkasangraha_sectionId": 52,
    "title": "Vākya-dvayam (Two Kinds of Sentences)",
    "content": "Vākya (sentence) is of two types: Vaidika (Vedic) and Laukika (secular/worldly). Vaidika sentences are all authoritative (Pramāṇa) because they are spoken by Īśvara (God). Laukika sentences are authoritative only if spoken by an Āpta (a reliable person); others are not authoritative."
  },
  {
    "sectionId": 53,
    "tarkasangraha_sectionId": 53,
    "title": "Śabda-jñānam (Verbal Cognition)",
    "content": "The knowledge of the meaning of a sentence is Śābda-jñāna. Its instrument (Karaṇa) is the Śabda (word/testimony)."
  },
  {
    "sectionId": 54,
    "tarkasangraha_sectionId": 54,
    "title": "Ayathārtha-anubhava (Invalid Experience)",
    "content": "Invalid experience is of three kinds: Saṃśaya (doubt), Viparyaya (error), and Tarka (hypothetical reasoning). \n1. Saṃśaya: Knowledge that attributes multiple conflicting properties to a single object. For example, \"Is that a tree-stump or a man?\"\n2. Viparyaya: False knowledge. For example, perceiving \"This is silver\" in a mother-of-pearl shell.\n3. Tarka: Attribution of a pervader (Vyāpaka) based on the false attribution of the pervaded (Vyāpya). For example, \"If there were no fire, then there would be no smoke.\""
  },
  {
    "sectionId": 55,
    "tarkasangraha_sectionId": 55,
    "title": "Smṛti (Memory)",
    "content": "Smṛti is also of two types: Yathārtha (valid) and Ayathārtha (invalid). Memory produced from valid knowledge (Pramā) is valid. Memory produced from invalid knowledge (Apramā) is invalid."
  },
  {
    "sectionId": 56,
    "tarkasangraha_sectionId": 56,
    "title": "Sukham (Pleasure)",
    "content": "Sukha is that which is experienced by everyone as being Anukūla (agreeable/pleasant)."
  },
  {
    "sectionId": 57,
    "tarkasangraha_sectionId": 57,
    "title": "Duḥkham (Pain)",
    "content": "Duḥkha is that which is experienced as being Pratikūla (disagreeable/unpleasant)."
  },
  {
    "sectionId": 58,
    "tarkasangraha_sectionId": 58,
    "title": "Icchā (Desire)",
    "content": "Icchā is Kāma (desire/longing)."
  },
  {
    "sectionId": 59,
    "tarkasangraha_sectionId": 59,
    "title": "Dveṣa (Aversion)",
    "content": "Dveṣa is Krodha (anger/hatred)."
  },
  {
    "sectionId": 60,
    "tarkasangraha_sectionId": 60,
    "title": "Prayatna (Effort)",
    "content": "Prayatna is Kṛti (volition or conscious effort)."
  },
  {
    "sectionId": 61,
    "tarkasangraha_sectionId": 61,
    "title": "Dharma (Merit)",
    "content": "Dharma is that which is produced by performing actions enjoined/prescribed by the scriptures (Vihita-karma)."
  },
  {
    "sectionId": 62,
    "tarkasangraha_sectionId": 62,
    "title": "Adharma (Demerit)",
    "content": "Adharma is that which is produced by performing actions prohibited by the scriptures (Niṣiddha-karma)."
  },
  {
    "sectionId": 63,
    "tarkasangraha_sectionId": 63,
    "title": "Ātma-viśeṣa-guṇāḥ (Special Qualities of the Soul)",
    "content": "The eight qualities beginning with Buddhi (Buddhi, Sukha, Duḥkha, Icchā, Dveṣa, Prayatna, Dharma, and Adharma) are the special qualities belonging only to the Ātman."
  },
  {
    "sectionId": 64,
    "tarkasangraha_sectionId": 64,
    "title": "Nityānitya-guṇau (Eternal and Non-eternal Qualities)",
    "content": "Buddhi, Icchā, and Prayatna are of two types: Nitya (eternal) and Anitya (non-eternal). They are Nitya in Īśvara (God) and Anitya in the Jīva (individual soul)."
  },
  {
    "sectionId": 65,
    "tarkasangraha_sectionId": 65,
    "title": "Saṃskāra (Impression/Tendency)",
    "content": "Saṃskāra is of three kinds: Vega (momentum), Bhāvanā (mental impression), and Sthitisthāpaka (elasticity).\n1. Vega: Resides in the first four substances (Pṛthivī, Ap, Tejas, Vāyu) and Manas.\n2. Bhāvanā: Is produced by experience (Anubhava) and is the cause of memory (Smṛti). It resides only in the Ātman.\n3. Sthitisthāpaka: Is that which brings an object back to its original state after it has been altered. It resides in substances like mats (Kaṭa) and other earthy objects (Pṛthivī)."
  },
  {
    "sectionId": 66,
    "tarkasangraha_sectionId": 66,
    "title": "Karma (Action/Motion)",
    "content": "Karma consists of motion. Utkṣepaṇa is the cause of conjunction with an upper region (upward motion). Apakṣepaṇa is the cause of conjunction with a lower region (downward motion). Ākuñcana is the cause of conjunction with a region near the body (contraction). Prasāraṇa is the cause of conjunction with a region far from the body (expansion). All other types of motion are Gamana (locomotion). It resides only in the first four substances (Pṛthivī, Ap, Tejas, Vāyu) and Manas."
  },
  {
    "sectionId": 67,
    "tarkasangraha_sectionId": 67,
    "title": "Sāmānya (Generality/Universality)",
    "content": "Sāmānya is eternal, one, and inherent in many. It resides in Dravya, Guṇa, and Karma. It is of two types: Para (higher) and Apara (lower). The Para is Sattā (Being/Existence). The Apara consists of categories like Dravyatva (substance-ness) and so on."
  },
  {
    "sectionId": 68,
    "tarkasangraha_sectionId": 68,
    "title": "Viśeṣa (Particularity)",
    "content": "Viśeṣas are the ultimate differentiators that reside in eternal substances (Nitya-dravya)."
  },
  {
    "sectionId": 69,
    "tarkasangraha_sectionId": 69,
    "title": "Samavāya (Inherence)",
    "content": "Samavāya is an eternal relation. It resides in things that are Ayuta-siddha (inseparably connected). Two things are Ayuta-siddha when, as long as they exist and are not destroyed, one of them necessarily rests upon the other. Examples include: the parts and the whole (Avayava-avayavin), the quality and the qualified (Guṇa-guṇin), the action and the actor (Kriyā-kriyāvant), the class and the individual (Jāti-vyakti), and particularity and eternal substances (Viśeṣa-nitya-dravya)."
  },
  {
    "sectionId": 70,
    "tarkasangraha_sectionId": 70,
    "title": "Abhāva (Non-existence/Absence)",
    "content": "1. Prāgabhāva (Antecedent non-existence): Has no beginning but has an end; it exists before the production of an effect.\n2. Pradhvaṃsa (Destructive non-existence): Has a beginning but no end; it exists after the destruction of an effect.\n3. Atyantābhāva (Absolute non-existence): A non-existence whose counter-correlative is limited by a relation occurring in all three periods of time (past, present, future). For example: \"There is no pot on the ground.\"\n4. Anyonyābhāva (Mutual non-existence): A non-existence whose counter-correlative is limited by the relation of identity (Tādātmya). For example: \"A pot is not a cloth.\""
  },
  {
    "sectionId": 71,
    "tarkasangraha_sectionId": 71,
    "title": "Sapta-padārtha-siddhi (Conclusion of the Seven Categories)",
    "content": "Since all objects of experience are properly included in those already mentioned, it is proved that there are only seven Padārthas."
  },
  {
    "sectionId": 72,
    "tarkasangraha_sectionId": 72,
    "title": "Samāpanam (Concluding Verse)",
    "content": "To ensure the proficiency of beginners in the systems of Kaṇāda (Vaiśeṣika) and Nyāya, this Tarka Sangraha was composed by the learned scholar Annam Bhaṭṭa. Thus concludes the Tarka Sangraha composed by the great teacher Annam Bhaṭṭa."
  }
]